var app = angular.module('myApp', []);

app.filter('to_trusted', ['$sce', function ($sce) {
  return function (text) {
    return $sce.trustAsHtml(text);
  };
}]);

app.controller('myCtrl', function($scope) {

$scope.userInfo = {
    "name": "王姵蓉",
    "dept": "資管系",
    "describe": "程式好難r"
  }

$scope.content = [
  {
    "title": "文書",
    "type": 1,
    "descriptions": "1.請各專題組於106年6月8日(四)17點前繳交1頁專題簡介電子檔至系辦：簡介請包含以下三項：(1)動機。(2)使用技術。(3)預期成果。 2.請各專題組於106年6月22日(四)中午12點前繳交3本書面計畫書及一份簡報檔案至系辦並測試無誤，為維持公平原則起見，計畫書及簡報內容不可出現專題指導老師姓名。"
  },
  {
    "title": "程式設計",
    "type": 1,
    "descriptions": '<iframe width="350" height="300" src="https://www.youtube.com/embed/0NLO7ciejT4" frameborder="0" allowfullscreen></iframe>'
  },
  {
    "title": "場地",
    "type": 2,
    "descriptions": '他陽意實幾；黃清良字我看風過理想源毛老中四價影指球，養在持的笑下離座代。統一是星體眾靈學總界留，病不痛總性量處的外技分子驚為小非負而，戲只製言軍名是不們我明用方：生體成？開因受養到上全始這過了就小實喜。思我一客產哥做：如國的中他里而的師分，上樓就長電打成意不為在戲一功集書時石驗花：人是戰……無色以全爸：加麼中為，我把文會是領時的成列德、方自轉舉候女？讀應防電！發活先時間得外二無；很分會，得料出行的吃故親的能無黨命點了：公起把日源展，通公見，能麼議行通呢這兒狀區底！畫星入任理試了：像模每神自當課天我，我士步我似工客負這改無明紀的馬；大空現。我活成頭爭年臺！縣他們與，親說影心些靜；滿覺再正職一曾打人告二過命則了把負八此清場子白足師要速，天學究間地近要沒。'
  },
  {
    "title": "隊輔",
    "type": 2,
    "descriptions": '年化行然信不老言陸保看入大優車上病別要與，嚴過法方頭。花稱風我親？出依去？他海時計開景問工生，不以提……農有相次先自些開著得成裝不參能的……的前熱務識證對事學致，次出各醫人入反都三、節觀日八道學選行，外北年可說流：策畫百十活海性正資且角是國？藝全現發笑，點興那食心坡生頭個美是會女的在不地爸注獨利死的屋目議了寫自年學入如血完處，並達包。常藝苦酒要代；本者落人、教過場親學使未較象人開……物雖女。落管本河公後。難解的術待府命情，我企題好子起會心負沒心，向處果般，景制英溫如管然飛最文眾清手收民過待才那落然或文好仍為相。'
  }
]; 

    $scope.data = [
  {
    "item": "專題初審",
    "type":1,    
    "keywords": [
      "程式設計",
      "中原",
      "文書",
      "硬體設備"
    ],
    "joined": 3
  },
  {
    "item": "宿營企劃",
    "type": 2, 
    "keywords": [
      "場地",
      "隊輔",
      "活動規劃",
      "備案"
    ],
    "joined": 20
  },
  {
    "item": "母親節",
    "type": 3, 
    "keywords": [
      "禮物",
      "餐廳",
      "優惠券",
      "百貨公司"
    ],
    "joined": 4
  }
];
}

);